# Merging, Joining, and Concatenating

There are 3 main ways of combining DataFrames together: 

1.Merging
2.Joining 
3.Concatenating

____

In [3]:
import pandas as pd

In [9]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [5]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [6]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [30]:
df1.shape

(4, 4)

In [31]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [32]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [33]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

## Concatenation

Concatenation basically glues together DataFrames. Keep in mind that dimensions should match along the axis you are concatenating on. You can use **pd.concat** and pass in a list of DataFrames to concatenate together:

In [7]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [8]:
pd.concat([df1,df2,df3],axis = 1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [10]:
df5 = pd.DataFrame({'A': ['A4','A5'],
                        'B': ['B4','B5'],
                        'E': ['D4','D5']}
                         )

In [10]:
df5

    A   B   E
0  A4  B4  D4
1  A5  B5  D5

In [11]:
df5.shape, df1.shape

((2, 3), (4, 4))

In [15]:
pd.concat([df5,df1])

    A   B    E    C    D
0  A4  B4   D4  NaN  NaN
1  A5  B5   D5  NaN  NaN
0  A0  B0  NaN   C0   D0
1  A1  B1  NaN   C1   D1
2  A2  B2  NaN   C2   D2
3  A3  B3  NaN   C3   D3

In [16]:
new_df = pd.concat([df1,df5]).reset_index()
new_df

   index   A   B    C    D    E
0      0  A0  B0   C0   D0  NaN
1      1  A1  B1   C1   D1  NaN
2      2  A2  B2   C2   D2  NaN
3      3  A3  B3   C3   D3  NaN
4      0  A4  B4  NaN  NaN   D4
5      1  A5  B5  NaN  NaN   D5

In [41]:
new_df.index

RangeIndex(start=0, stop=6, step=1)

In [104]:
pd.concat([df1,df5], axis = 1)

    A   B   C   D    A    B    E
0  A0  B0  C0  D0   A4   B4   D4
1  A1  B1  C1  D1   A5   B5   D5
2  A2  B2  C2  D2  NaN  NaN  NaN
3  A3  B3  C3  D3  NaN  NaN  NaN

In [105]:
pd.concat([df1,df2,df3], axis = 1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [106]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [107]:
df5

    A   B   E
0  A4  B4  D4
1  A5  B5  D5

In [108]:
pd.concat([df1, df5], axis = 1)

    A   B   C   D    A    B    E
0  A0  B0  C0  D0   A4   B4   D4
1  A1  B1  C1  D1   A5   B5   D5
2  A2  B2  C2  D2  NaN  NaN  NaN
3  A3  B3  C3  D3  NaN  NaN  NaN

In [109]:
pd.concat([df5, df1], axis = 1)

     A    B    E   A   B   C   D
0   A4   B4   D4  A0  B0  C0  D0
1   A5   B5   D5  A1  B1  C1  D1
2  NaN  NaN  NaN  A2  B2  C2  D2
3  NaN  NaN  NaN  A3  B3  C3  D3

In [ ]:
pd.concat([df1,df2,df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [111]:
pd.join([df1,df2,df3])

AttributeError: module 'pandas' has no attribute 'join'

In [5]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

_____
## Example DataFrames

In [28]:
import pandas as pd
l1 = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A10', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B10', 'B2', 'B3']})
   
r1 = pd.DataFrame({'key': ['K3', 'K1', 'K20', 'K0'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [29]:
l1

  key    A    B
0  K0  A10   B0
1  K1   A1  B10
2  K2   A2   B2
3  K3   A3   B3

In [7]:
r1

   key   C   D
0   K3  C0  D0
1   K1  C1  D1
2  K20  C2  D2
3   K0  C3  D3

## Merging

The **merge** function allows you to merge DataFrames together using a similar logic as merging SQL Tables together. For example:

In [5]:
pd.merge(l1,r1)

  key   A   B   C   D
0  K0  A0  B0  C3  D3
1  K1  A1  B1  C1  D1
2  K3  A3  B3  C0  D0

In [16]:
l1

  key    A    B
0  K0  A10   B0
1  K1   A1  B10
2  K2   A2  B12
3  K3  A13   B3

In [30]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [34]:
pd.merge(l1,df1, how = 'inner', on=['A','B'], suffixes= ["_DF1",'_L1'])

  key   A   B   C   D
0  K2  A2  B2  C2  D2
1  K3  A3  B3  C3  D3

In [ ]:
pd.merge(l1,r1, how  = 'inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C3  D3
1  K1  A1  B1  C1  D1
2  K3  A3  B3  C0  D0

In [20]:
pd.merge(l1,r1,how='right',on='key')

   key    A    B   C   D
0   K0   A0   B0  C0  D0
1   K1   A1   B1  C1  D1
2  K20  NaN  NaN  C2  D2
3   K3   A3   B3  C3  D3

In [31]:
pd.merge(l1,r1,how='left',on='key')

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K1  A1  B1   C1   D1
2  K2  A2  B2  NaN  NaN
3  K3  A3  B3   C3   D3

In [32]:
#pd.merge(df1,df2,how='left',on='key')
pd.merge(r1,l1,how='left',on='key')

   key   C   D    A    B
0   K0  C0  D0   A0   B0
1   K1  C1  D1   A1   B1
2  K20  C2  D2  NaN  NaN
3   K3  C3  D3   A3   B3

In [33]:
#pd.merge(df1,df2,how='left',on='key')
pd.merge(l1,r1,how='outer',on='key')

   key    A    B    C    D
0   K0   A0   B0   C0   D0
1   K1   A1   B1   C1   D1
2   K2   A2   B2  NaN  NaN
3   K3   A3   B3   C3   D3
4  K20  NaN  NaN   C2   D2

In [26]:
#pd.merge(df1,df2,how='left',on='key')
pd.merge(l1,r1,how='cross')

   key_x   A   B key_y   C   D
0     K0  A0  B0    K0  C0  D0
1     K0  A0  B0    K1  C1  D1
2     K0  A0  B0   K20  C2  D2
3     K0  A0  B0    K3  C3  D3
4     K1  A1  B1    K0  C0  D0
5     K1  A1  B1    K1  C1  D1
6     K1  A1  B1   K20  C2  D2
7     K1  A1  B1    K3  C3  D3
8     K2  A2  B2    K0  C0  D0
9     K2  A2  B2    K1  C1  D1
10    K2  A2  B2   K20  C2  D2
11    K2  A2  B2    K3  C3  D3
12    K3  A3  B3    K0  C0  D0
13    K3  A3  B3    K1  C1  D1
14    K3  A3  B3   K20  C2  D2
15    K3  A3  B3    K3  C3  D3

## Joining
Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [39]:
import pandas as pd
import numpy as np 
df_l = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', np.nan]},
                      index=['K0', 'K1', 'K2']) 

df_r = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'A': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K30'])

In [41]:
df_r.join(df_l, rsuffix= 'a')

      C   A   Aa    B
K0   C0  D0   A0   B0
K2   C2  D2   A2  NaN
K30  C3  D3  NaN  NaN

In [42]:
df_r.join(df_l, how='inner', rsuffix=2)

     C   A  A2    B
K0  C0  D0  A0   B0
K2  C2  D2  A2  NaN

In [13]:
### df.join(df2, how = 'right')
join_df = df_r.join(df_l, how = 'outer')
join_df

       C    D    A    B
K0    C0   D0   A0   B0
K1   NaN  NaN   A1   B1
K2    C2   D2   A2  NaN
K30   C3   D3  NaN  NaN

In [38]:
s1 = pd.Series(np.arange(20,27), name='a')

In [40]:
s1.index  = ['K1','K0','K20','K30','K2','K10','k4']

In [37]:
pd.concat([join_df,s1],axis = 1)

       C    D    A    B   0
K0   NaN  NaN   A0   B0  21
K1   NaN  NaN   A1   B1  20
K10   C0   D0  NaN  NaN  25
K2   NaN  NaN   A2  NaN  24
K20   C2   D2  NaN  NaN  22
K30   C3   D3  NaN  NaN  23
k4   NaN  NaN  NaN  NaN  26

In [41]:
join_df.join(s1)

       C    D    A    B   a
K0   NaN  NaN   A0   B0  21
K1   NaN  NaN   A1   B1  20
K10   C0   D0  NaN  NaN  25
K2   NaN  NaN   A2  NaN  24
K20   C2   D2  NaN  NaN  22
K30   C3   D3  NaN  NaN  23

In [ ]:
help(right1.join)

Help on method join in module pandas.core.frame:

join(other, on=None, how='left', lsuffix='', rsuffix='', sort=False) -> 'DataFrame' method of pandas.core.frame.DataFrame instance
    Join columns of another DataFrame.

    Join columns with `other` DataFrame either on index or on a key
    column. Efficiently join multiple DataFrame objects by index at once by
    passing a list.

    Parameters
    ----------
    other : DataFrame, Series, or list of DataFrame
        Index should be similar to one of the columns in this one. If a
        Series is passed, its name attribute must be set, and that will be
        used as the column name in the resulting joined DataFrame.
    on : str, list of str, or array-like, optional
        Column or index level name(s) in the caller to join on the index
        in `other`, otherwise joins index-on-index. If multiple
        values given, the `other` DataFrame must have a MultiIndex. Can
        pass an array as the join key if it is not already contained in
        the calling DataFrame. Like an Excel VLOOKUP operation.
    how : {'left', 'right', 'outer', 'inner'}, default 'left'
        How to handle the operation of the two objects.

        * left: use calling frame's index (or column if on is specified)
        * right: use `other`'s index.
        * outer: form union of calling frame's index (or column if on is
          specified) with `other`'s index, and sort it.
          lexicographically.
        * inner: form intersection of calling frame's index (or column if
          on is specified) with `other`'s index, preserving the order
          of the calling's one.
    lsuffix : str, default ''
        Suffix to use from left frame's overlapping columns.
    rsuffix : str, default ''
        Suffix to use from right frame's overlapping columns.
    sort : bool, default False
        Order result DataFrame lexicographically by the join key. If False,
        the order of the join key depends on the join type (how keyword).

    Returns
    -------
    DataFrame
        A dataframe containing columns from both the caller and `other`.

    See Also
    --------
    DataFrame.merge : For column(s)-on-columns(s) operations.

    Notes
    -----
    Parameters `on`, `lsuffix`, and `rsuffix` are not supported when
    passing a list of `DataFrame` objects.

    Support for specifying index levels as the `on` parameter was added
    in version 0.23.0.

    Examples
    --------
    >>> df = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3', 'K4', 'K5'],
    ...                    'A': ['A0', 'A1', 'A2', 'A3', 'A4', 'A5']})

    >>> df
      key   A
    0  K0  A0
    1  K1  A1
    2  K2  A2
    3  K3  A3
    4  K4  A4
    5  K5  A5

    >>> other = pd.DataFrame({'key': ['K0', 'K1', 'K2'],
    ...                       'B': ['B0', 'B1', 'B2']})

    >>> other
      key   B
    0  K0  B0
    1  K1  B1
    2  K2  B2

    Join DataFrames using their indexes.

    >>> df.join(other, lsuffix='_caller', rsuffix='_other')
      key_caller   A key_other    B
    0         K0  A0        K0   B0
    1         K1  A1        K1   B1
    2         K2  A2        K2   B2
    3         K3  A3       NaN  NaN
    4         K4  A4       NaN  NaN
    5         K5  A5       NaN  NaN

    If we want to join using the key columns, we need to set key to be
    the index in both `df` and `other`. The joined DataFrame will have
    key as its index.

    >>> df.set_index('key').join(other.set_index('key'))
          A    B
    key
    K0   A0   B0
    K1   A1   B1
    K2   A2   B2
    K3   A3  NaN
    K4   A4  NaN
    K5   A5  NaN

    Another option to join using the key columns is to use the `on`
    parameter. DataFrame.join always uses `other`'s index but we can use
    any column in `df`. This method preserves the original DataFrame's
    index in the result.

    >>> df.join(other.set_index('key'), on='key')
      key   A    B
    0  K0  A0   B0
    1  K1  A1   B1
    2  K2  A2   B2
    3  K3  A3  NaN
    4  K4  A4  NaN
    5  K5  A5  NaN

In [ ]:
"/C:\Users/home/Desktop\\Machine Learning\\datasets"

'/C:/Users/home/Desktop\\Machine Learning\\datasets'

In [ ]:
#a=pd.read

a=pd.read_csv(r"C:\Users\home\Desktop\Machine Learning\datasets\bank.csv")
a.tail()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
4516,33,services,married,secondary,no,-333,yes,no,cellular,30,jul,329,5,-1,0,unknown,no
4517,57,self-employed,married,tertiary,yes,-3313,yes,yes,unknown,9,may,153,1,-1,0,unknown,no
4518,57,technician,married,secondary,no,295,no,no,cellular,19,aug,151,11,-1,0,unknown,no
4519,28,blue-collar,married,secondary,no,1137,no,no,cellular,6,feb,129,4,211,3,other,no
4520,44,entrepreneur,single,tertiary,no,1136,yes,yes,cellular,3,apr,345,2,249,7,other,no

In [ ]:
a.describe()

,age,balance,day,duration,campaign,pdays,previous
count,4521.000000,4521.000000,4521.000000,4521.000000,4521.000000,4521.000000,4521.000000
mean,41.170095,1422.657819,15.915284,263.961292,2.793630,39.766645,0.542579
std,10.576211,3009.638142,8.247667,259.856633,3.109807,100.121124,1.693562
min,19.000000,-3313.000000,1.000000,4.000000,1.000000,-1.000000,0.000000
25%,33.000000,69.000000,9.000000,104.000000,1.000000,-1.000000,0.000000
50%,39.000000,444.000000,16.000000,185.000000,2.000000,-1.000000,0.000000
75%,49.000000,1480.000000,21.000000,329.000000,3.000000,-1.000000,0.000000
max,87.000000,71188.000000,31.000000,3025.000000,50.000000,871.000000,25.000000

In [ ]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# END

In [ ]:
help(right1.join)

Help on method join in module pandas.core.frame:

join(other, on=None, how='left', lsuffix='', rsuffix='', sort=False) -> 'DataFrame' method of pandas.core.frame.DataFrame instance
    Join columns of another DataFrame.

    Join columns with `other` DataFrame either on index or on a key
    column. Efficiently join multiple DataFrame objects by index at once by
    passing a list.

    Parameters
    ----------
    other : DataFrame, Series, or list of DataFrame
        Index should be similar to one of the columns in this one. If a
        Series is passed, its name attribute must be set, and that will be
        used as the column name in the resulting joined DataFrame.
    on : str, list of str, or array-like, optional
        Column or index level name(s) in the caller to join on the index
        in `other`, otherwise joins index-on-index. If multiple
        values given, the `other` DataFrame must have a MultiIndex. Can
        pass an array as the join key if it is not already contained in
        the calling DataFrame. Like an Excel VLOOKUP operation.
    how : {'left', 'right', 'outer', 'inner'}, default 'left'
        How to handle the operation of the two objects.

        * left: use calling frame's index (or column if on is specified)
        * right: use `other`'s index.
        * outer: form union of calling frame's index (or column if on is
          specified) with `other`'s index, and sort it.
          lexicographically.
        * inner: form intersection of calling frame's index (or column if
          on is specified) with `other`'s index, preserving the order
          of the calling's one.
    lsuffix : str, default ''
        Suffix to use from left frame's overlapping columns.
    rsuffix : str, default ''
        Suffix to use from right frame's overlapping columns.
    sort : bool, default False
        Order result DataFrame lexicographically by the join key. If False,
        the order of the join key depends on the join type (how keyword).

    Returns
    -------
    DataFrame
        A dataframe containing columns from both the caller and `other`.

    See Also
    --------
    DataFrame.merge : For column(s)-on-columns(s) operations.

    Notes
    -----
    Parameters `on`, `lsuffix`, and `rsuffix` are not supported when
    passing a list of `DataFrame` objects.

    Support for specifying index levels as the `on` parameter was added
    in version 0.23.0.

    Examples
    --------
    >>> df = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3', 'K4', 'K5'],
    ...                    'A': ['A0', 'A1', 'A2', 'A3', 'A4', 'A5']})

    >>> df
      key   A
    0  K0  A0
    1  K1  A1
    2  K2  A2
    3  K3  A3
    4  K4  A4
    5  K5  A5

    >>> other = pd.DataFrame({'key': ['K0', 'K1', 'K2'],
    ...                       'B': ['B0', 'B1', 'B2']})

    >>> other
      key   B
    0  K0  B0
    1  K1  B1
    2  K2  B2

    Join DataFrames using their indexes.

    >>> df.join(other, lsuffix='_caller', rsuffix='_other')
      key_caller   A key_other    B
    0         K0  A0        K0   B0
    1         K1  A1        K1   B1
    2         K2  A2        K2   B2
    3         K3  A3       NaN  NaN
    4         K4  A4       NaN  NaN
    5         K5  A5       NaN  NaN

    If we want to join using the key columns, we need to set key to be
    the index in both `df` and `other`. The joined DataFrame will have
    key as its index.

    >>> df.set_index('key').join(other.set_index('key'))
          A    B
    key
    K0   A0   B0
    K1   A1   B1
    K2   A2   B2
    K3   A3  NaN
    K4   A4  NaN
    K5   A5  NaN

    Another option to join using the key columns is to use the `on`
    parameter. DataFrame.join always uses `other`'s index but we can use
    any column in `df`. This method preserves the original DataFrame's
    index in the result.

    >>> df.join(other.set_index('key'), on='key')
      key   A    B
    0  K0  A0   B0
    1  K1  A1   B1
    2  K2  A2   B2
    3  K3  A3  NaN
    4  K4  A4  NaN
    5  K5  A5  NaN

In [ ]:
import glob
l1 =[]
for i in ['a','b','c']:
    df = i
    l1.append()
pd.concat(l1)

'c'

In [ ]:
l1= []
for i in range(3):
    var_name = f"my_variable_{i}"    
    l1.append(var_name)
l1

['my_variable_0', 'my_variable_1', 'my_variable_2']

In [3]:
l2 = []
for i in range(5):
    globals()[f"global_var_{i}"] = i * 100
    l2.append(f"global_var_{i}")
l2

['global_var_0',
 'global_var_1',
 'global_var_2',
 'global_var_3',
 'global_var_4']

In [ ]:
pd.concat(l2)

In [5]:
global_var_2

200

In [20]:
import os 
listdir1 = os.listdir(r"E:\Python\Machine Learning\datasets")

In [21]:
listdir1

['.RData',
 '.Rhistory',
 'ABSA.diabetes_india.csv',
 'accidental-deaths-in-usa-monthly.csv',
 'ads.csv',
 'ads_hour.csv',
 'adult.data.csv',
 'adult_test.csv',
 'adult_train.csv',
 'Advertising.csv',
 'affairs.csv',
 'AirPassengers.csv',
 'animals.xlsx',
 'appleshares.csv',
 'auto-specs.csv',
 'Auto.csv',
 'bank-full.csv',
 'bank-names.txt',
 'bank.csv',
 'beauty.csv',
 'bill_authentication.csv',
 'birth-data.csv',
 'boston.csv',
 'breast-cancer-diag.csv',
 'breast-cancer-wisconsin.csv',
 'breastcancer-rf.csv',
 'breastcancer.csv',
 'breastcancer_orig.csv',
 'cal_housing.data',
 'cal_housing.domain',
 'car-theft.csv',
 'cassandra-yaml.txt',
 'CAvideos.csv',
 'CA_category_id.json',
 'census.csv',
 'chiporder.tsv',
 'churn-all.csv',
 'Churn.xls',
 'churn_data.csv',
 'churn_names.csv',
 'churn_test.csv',
 'class.csv',
 'clusterable_data.npy',
 'college.txt',
 'collegedata.csv',
 'concrete.csv',
 'Concrete_Data - Copy.xls',
 'Concrete_Data.xls',
 'Concrete_Data_Yeh.csv',
 'copenhagen_housing_survey.csv',
 'Covid_19',
 'covid_19_india.csv',
 'credit.csv',
 'credit_scoring_sample.csv',
 'currency.csv',
 'customers.csv',
 'daily-minimum-temperatures-in-me.csv',
 'daily-total-female-births-in-cal.csv',
 'data-for-chi2.csv',
 'data.xlsx',
 'database.csv',
 'datasets.zip',
 'dec-tree-explain.csv',
 'dec-tree-explain.xlsx',
 'delivery-driver.tsv',
 'derby.log',
 'device.csv',
 'DEvideos.csv',
 'DE_category_id.json',
 'diabetes.csv',
 'diabetes.dat',
 'documents_category.xlsx',
 'download.log',
 'dt_data.csv',
 'energy.csv',
 'ex1data1.txt',
 'flight_delays_test.csv',
 'flight_delays_train.csv',
 'flu - Copy.xlsx',
 'flu.csv',
 'flu.xlsx',
 'flu_copy.txt',
 'forestfires.csv',
 'FRvideos.csv',
 'FR_category_id.json',
 'game.csv',
 'GBvideos.csv',
 'GB_category_id.json',
 'gdp.csv',
 'glass.csv',
 'golf.xlsx',
 'headsize.csv',
 'HELP.xlsx',
 'Hitters.csv',
 'hostel_factors.csv',
 'housing.csv',
 'imdb.csv',
 'IMDB_data.csv',
 'income.xlsx',
 'INFY.csv',
 'iris',
 'iris.csv',
 'iris.pdf',
 'irisGB_BOOST.csv',
 'iris_graph_render',
 'iris_graph_render.pdf',
 'iris_test_RF.csv',
 'iris_train_RF.csv',
 'kidney_disease.csv',
 'loan_prediction.zip',
 'microchip_tests.txt',
 'mlbootcamp5_train.csv',
 'model_pima.sav',
 'movies.csv',
 'movies.xls',
 'multiTimeline.csv',
 'mushroom.csv',
 'NB-sample-sports.txt',
 'New folder',
 'newtwitter.csv',
 'NEW_READING.CSV',
 'occupancy.csv',
 'pandas_ex1.csv',
 'pandas_ex2.csv',
 'pandas_ex3.csv',
 'petrol_consumption.csv',
 'pima-indians-diabetes-database.zip',
 'pima.csv',
 'PlantGrowth.csv',
 'play_golf.csv',
 'Pokemon.csv',
 'polarityData-neg.txt',
 'polarityData-pos.txt',
 'POS Tagging.txt',
 'pos-neg.xlsx',
 'Position_Salaries.csv',
 'ratings.csv',
 'review.txt',
 'review_polarity.tar.gz',
 'run.csv',
 'sales-of-shampoo-over-a-three-ye.csv',
 'sales.csv',
 'sales_data_types.csv',
 'sample.csv',
 'sample.txt',
 'sample_stocks.csv',
 'samsung_test_labels.txt',
 'samsung_train_labels.txt',
 'sealevel.csv',
 'seed.csv',
 'Sentiment.csv',
 'shopping_data.csv',
 'site_dic.pkl',
 'sms.tsv',
 'sonar.all-data.csv',
 'spam.csv',
 'stocks-k-prototypes.csv',
 'student.csv',
 'Superstore.xls',
 'Symbiosis_data_sets',
 'telecom_churn.csv',
 'temps-tree',
 'temps-tree.pdf',
 'temps.csv',
 'test-housing.csv',
 'test.csv',
 'test.tsv.zip',
 'text_csv.csv',
 'tips.csv',
 'titanic-gender_submission.csv',
 'titanic-test.csv',
 'titanic-train.csv',
 'titanic_test.csv',
 'titanic_train.csv',
 'topic-modelling.txt',
 'train-housing.csv',
 'train.csv',
 'train.tsv.zip',
 'TweetsSentiments.xlsm',
 'two-class+complaints+modified.txt',
 'Two-class.csv',
 'two-class_complaints_modified.csv',
 'Unemployment in India.csv',
 'Unemployment_Rate_upto_11_2020.csv',
 'us-airports.csv',
 'USvideos.csv',
 'US_category_id.json',
 'video_games_sales.csv',
 'Video_Games_Sales_as_at_22_Dec_2016.csv',
 'voice.csv',
 'weights_heights.csv',
 'Wholesale-customers-data.csv',
 'wiki_machine_learning.csv',
 'Wine.csv',
 'WineKMC.xlsx',
 'winequality-data-lda.csv',
 'winequality-data1.csv',
 'winequality-names.txt',
 'winequality-red.csv',
 'winequality-white.csv',
 'WMA_test_data.xls',
 'WORDS.xlsx',
 'wordwithStrength.txt',
 'xclara.csv',
 'XML_DATA',
 'yahoo.csv',
 'yelp.csv']

In [42]:
new_df

   index   A   B    C    D    E
0      0  A0  B0   C0   D0  NaN
1      1  A1  B1   C1   D1  NaN
2      2  A2  B2   C2   D2  NaN
3      3  A3  B3   C3   D3  NaN
4      0  A4  B4  NaN  NaN   D4
5      1  A5  B5  NaN  NaN   D5

In [46]:
new_df = pd.DataFrame({'a':[1,2,2,3,4],
                       'b':[10,20,30,40,50],
                       'c':['a','b','c','d','e'],
                       })
new_df

   a   b  c
0  1  10  a
1  2  20  b
2  2  30  c
3  3  40  d
4  4  50  e

In [52]:
new_df.set_index('c',inplace= True)

In [ ]:
new_df.reset_index(inplace=True)
new_df

ValueError: cannot insert level_0, already exists

In [66]:
new_df.columns

Index(['level_0', 'index', 'c', 'a', 'b'], dtype='object')

In [67]:
new_df.drop('level_0', axis =1, inplace= True)

In [70]:
new_df

   index  c  a   b
0      0  a  1  10
1      1  b  2  20
2      2  c  2  30
3      3  d  3  40
4      4  e  4  50

In [71]:
list(new_df.iterrows())[0]

(0,
 index     0
 c         a
 a         1
 b        10
 Name: 0, dtype: object)

In [72]:
for i in new_df.iterrows():
    print(i)

(0, index     0
c         a
a         1
b        10
Name: 0, dtype: object)
(1, index     1
c         b
a         2
b        20
Name: 1, dtype: object)
(2, index     2
c         c
a         2
b        30
Name: 2, dtype: object)
(3, index     3
c         d
a         3
b        40
Name: 3, dtype: object)
(4, index     4
c         e
a         4
b        50
Name: 4, dtype: object)

In [73]:
new_df.interpolate()

C:\Users\ajoti\AppData\Local\Temp\ipykernel_39776\3694694924.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  new_df.interpolate()

   index  c  a   b
0      0  a  1  10
1      1  b  2  20
2      2  c  2  30
3      3  d  3  40
4      4  e  4  50

In [75]:
for i in new_df.interpolate():
    print(new_df[i] )

0    0
1    1
2    2
3    3
4    4
Name: index, dtype: int64
0    a
1    b
2    c
3    d
4    e
Name: c, dtype: object
0    1
1    2
2    2
3    3
4    4
Name: a, dtype: int64
0    10
1    20
2    30
3    40
4    50
Name: b, dtype: int64

C:\Users\ajoti\AppData\Local\Temp\ipykernel_39776\4109505921.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  for i in new_df.interpolate():

In [85]:
new_df

   index  c  a   b
0      0  a  1  10
1      1  b  2  20
2      2  c  2  30
3      3  d  3  40
4      4  e  4  50

In [87]:
new_df.loc[1,'b']

np.int64(20)

In [89]:
new_df.iloc[1,3]

np.int64(20)

In [84]:
list(new_df.itertuples())

[Pandas(Index=0, index=0, c='a', a=1, b=10),
 Pandas(Index=1, index=1, c='b', a=2, b=20),
 Pandas(Index=2, index=2, c='c', a=2, b=30),
 Pandas(Index=3, index=3, c='d', a=3, b=40),
 Pandas(Index=4, index=4, c='e', a=4, b=50)]

In [ ]:
list(new_df.itertuples())[0][2]

'a'

In [81]:
for i in new_df.itertuples():
    print(i[2])

a
b
c
d
e

In [118]:
for i in new_df.iterrows():
    print(str(i) +" ,   add" )

(0, index      0
A         A0
B         B0
C         C0
D         D0
E        NaN
Name: 0, dtype: object) ,   add
(1, index      1
A         A1
B         B1
C         C1
D         D1
E        NaN
Name: 1, dtype: object) ,   add
(2, index      2
A         A2
B         B2
C         C2
D         D2
E        NaN
Name: 2, dtype: object) ,   add
(3, index      3
A         A3
B         B3
C         C3
D         D3
E        NaN
Name: 3, dtype: object) ,   add
(4, index      0
A         A4
B         B4
C        NaN
D        NaN
E         D4
Name: 4, dtype: object) ,   add
(5, index      1
A         A5
B         B5
C        NaN
D        NaN
E         D5
Name: 5, dtype: object) ,   add

In [126]:
df_json = pd.read_json('D:\\ML_code\\datasets\\datasets\\US_category_id.json')

In [129]:
df_json.columns

Index(['kind', 'etag', 'items'], dtype='object')

In [131]:
df_json['items'][0]

{'kind': 'youtube#videoCategory',
 'etag': '"m2yskBQFythfE4irbTIeOgYYfBU/Xy1mB4_yLrHy_BmKmPBggty2mZQ"',
 'id': '1',
 'snippet': {'channelId': 'UCBR8-60-B28hp2BmDPdntcQ',
  'title': 'Film & Animation',
  'assignable': True}}

In [127]:
print(df_json.to_string())

                                 kind                                                       etag                                                                                                                                                                                                                           items
0   youtube#videoCategoryListResponse  "m2yskBQFythfE4irbTIeOgYYfBU/S730Ilt-Fi-emsQJvJAAShlR6hM"        {'kind': 'youtube#videoCategory', 'etag': '"m2yskBQFythfE4irbTIeOgYYfBU/Xy1mB4_yLrHy_BmKmPBggty2mZQ"', 'id': '1', 'snippet': {'channelId': 'UCBR8-60-B28hp2BmDPdntcQ', 'title': 'Film & Animation', 'assignable': True}}
1   youtube#videoCategoryListResponse  "m2yskBQFythfE4irbTIeOgYYfBU/S730Ilt-Fi-emsQJvJAAShlR6hM"        {'kind': 'youtube#videoCategory', 'etag': '"m2yskBQFythfE4irbTIeOgYYfBU/UZ1oLIIz2dxIhO45ZTFR3a3NyTA"', 'id': '2', 'snippet': {'channelId': 'UCBR8-60-B28hp2BmDPdntcQ', 'title': 'Autos & Vehicles', 'assignable': True}}
2   youtube#videoCategoryListResponse  "m2yskBQFythfE4irbTIeOgYYfBU/S730Ilt-Fi-emsQJvJAAShlR6hM"                  {'kind': 'youtube#videoCategory', 'etag': '"m2yskBQFythfE4irbTIeOgYYfBU/nqRIq97-xe5XRZTxbknKFVe5Lmg"', 'id': '10', 'snippet': {'channelId': 'UCBR8-60-B28hp2BmDPdntcQ', 'title': 'Music', 'assignable': True}}
3   youtube#videoCategoryListResponse  "m2yskBQFythfE4irbTIeOgYYfBU/S730Ilt-Fi-emsQJvJAAShlR6hM"         {'kind': 'youtube#videoCategory', 'etag': '"m2yskBQFythfE4irbTIeOgYYfBU/HwXKamM1Q20q9BN-oBJavSGkfDI"', 'id': '15', 'snippet': {'channelId': 'UCBR8-60-B28hp2BmDPdntcQ', 'title': 'Pets & Animals', 'assignable': True}}
4   youtube#videoCategoryListResponse  "m2yskBQFythfE4irbTIeOgYYfBU/S730Ilt-Fi-emsQJvJAAShlR6hM"                 {'kind': 'youtube#videoCategory', 'etag': '"m2yskBQFythfE4irbTIeOgYYfBU/9GQMSRjrZdHeb1OEM1XVQ9zbGec"', 'id': '17', 'snippet': {'channelId': 'UCBR8-60-B28hp2BmDPdntcQ', 'title': 'Sports', 'assignable': True}}
5   youtube#videoCategoryListResponse  "m2yskBQFythfE4irbTIeOgYYfBU/S730Ilt-Fi-emsQJvJAAShlR6hM"          {'kind': 'youtube#videoCategory', 'etag': '"m2yskBQFythfE4irbTIeOgYYfBU/FJwVpGCVZ1yiJrqZbpqe68Sy_OE"', 'id': '18', 'snippet': {'channelId': 'UCBR8-60-B28hp2BmDPdntcQ', 'title': 'Short Movies', 'assignable': False}}
6   youtube#videoCategoryListResponse  "m2yskBQFythfE4irbTIeOgYYfBU/S730Ilt-Fi-emsQJvJAAShlR6hM"        {'kind': 'youtube#videoCategory', 'etag': '"m2yskBQFythfE4irbTIeOgYYfBU/M-3iD9dwK7YJCafRf_DkLN8CouA"', 'id': '19', 'snippet': {'channelId': 'UCBR8-60-B28hp2BmDPdntcQ', 'title': 'Travel & Events', 'assignable': True}}
7   youtube#videoCategoryListResponse  "m2yskBQFythfE4irbTIeOgYYfBU/S730Ilt-Fi-emsQJvJAAShlR6hM"                 {'kind': 'youtube#videoCategory', 'etag': '"m2yskBQFythfE4irbTIeOgYYfBU/WmA0qYEfjWsAoyJFSw2zinhn2wM"', 'id': '20', 'snippet': {'channelId': 'UCBR8-60-B28hp2BmDPdntcQ', 'title': 'Gaming', 'assignable': True}}
8   youtube#videoCategoryListResponse  "m2yskBQFythfE4irbTIeOgYYfBU/S730Ilt-Fi-emsQJvJAAShlR6hM"         {'kind': 'youtube#videoCategory', 'etag': '"m2yskBQFythfE4irbTIeOgYYfBU/EapFaGYG7K0StIXVf8aba249tdM"', 'id': '21', 'snippet': {'channelId': 'UCBR8-60-B28hp2BmDPdntcQ', 'title': 'Videoblogging', 'assignable': False}}
9   youtube#videoCategoryListResponse  "m2yskBQFythfE4irbTIeOgYYfBU/S730Ilt-Fi-emsQJvJAAShlR6hM"         {'kind': 'youtube#videoCategory', 'etag': '"m2yskBQFythfE4irbTIeOgYYfBU/xId8RX7vRN8rqkbYZbNIytUQDRo"', 'id': '22', 'snippet': {'channelId': 'UCBR8-60-B28hp2BmDPdntcQ', 'title': 'People & Blogs', 'assignable': True}}
10  youtube#videoCategoryListResponse  "m2yskBQFythfE4irbTIeOgYYfBU/S730Ilt-Fi-emsQJvJAAShlR6hM"                 {'kind': 'youtube#videoCategory', 'etag': '"m2yskBQFythfE4irbTIeOgYYfBU/G9LHzQmx44rX2S5yaga_Aqtwz8M"', 'id': '23', 'snippet': {'channelId': 'UCBR8-60-B28hp2BmDPdntcQ', 'title': 'Comedy', 'assignable': True}}
11  youtube#videoCategoryListResponse  "m2yskBQFythfE4irbTIeOgYYfBU/S730Ilt-Fi-emsQJvJAAShlR6hM"          {'kind': 'youtube#videoCategory', 'etag': '"m2yskBQFythfE4irbTIeOgYYfBU/UVB9oxX2Bvqa_w_y3vXSLVK5E_s"', 'id': '24', 'snippet': {'channelId': 'UCBR8-60-B28hp2BmDPdntcQ', 'title': 'Entertainment', 'assignable': True}}
12  youtube#videoCategoryListResponse  "m2yskBQFythfE4irbTIeOgYYfBU/S730Ilt-Fi-emsQJvJAAShlR6hM"        {'kind': 'youtube#videoCategory', 'etag': '"m2yskBQFythfE4irbTIeOgYYfBU/QiLK0ZIrFoORdk_g2l_XR_ECjDc"', 'id': '25', 'snippet': {'channelId': 'UCBR8-60-B28hp2BmDPdntcQ', 'title': 'News & Politics', 'assignable': True}}
13  youtube#videoCategoryListResponse  "m2yskBQFythfE4irbTIeOgYYfBU/S730Ilt-Fi-emsQJvJAAShlR6hM"          {'kind': 'youtube#videoCategory', 'etag': '"m2yskBQFythfE4irbTIeOgYYfBU/r6Ck6Z0_L0rG37VJQR200SGNA_w"', 'id': '26', 'snippet': {'channelId': 'UCBR8-60-B28hp2BmDPdntcQ', 'title': 'Howto & Style', 'assignable': True}}
14  youtube#videoCategoryListResponse  "m2yskBQFythfE4irbTIeOgYYfBU/S730Ilt-Fi-emsQJvJAAShlR6hM"              {'kind': 'youtube#videoCategory', 'etag': '"m2yskBQFythfE4irbTIeOgYYfBU/EoYkczo9I3RCf96RveKTOgOPkUM"', 'id': '27', 'snippet': {'channelId': 'UCBR8-60-B28hp2BmDPdntcQ', 'title': 'Education', 'assignable': True}}
15  youtube#videoCategoryListResponse  "m2yskBQFythfE4irbTIeOgYYfBU/S730Ilt-Fi-emsQJvJAAShlR6hM"   {'kind': 'youtube#videoCategory', 'etag': '"m2yskBQFythfE4irbTIeOgYYfBU/w5HjcTD82G_XA3xBctS30zS-JpQ"', 'id': '28', 'snippet': {'channelId': 'UCBR8-60-B28hp2BmDPdntcQ', 'title': 'Science & Technology', 'assignable': True}}
16  youtube#videoCategoryListResponse  "m2yskBQFythfE4irbTIeOgYYfBU/S730Ilt-Fi-emsQJvJAAShlR6hM"  {'kind': 'youtube#videoCategory', 'etag': '"m2yskBQFythfE4irbTIeOgYYfBU/SalkJoBWq_smSEqiAx_qyri6Wa8"', 'id': '29', 'snippet': {'channelId': 'UCBR8-60-B28hp2BmDPdntcQ', 'title': 'Nonprofits & Activism', 'assignable': True}}
17  youtube#videoCategoryListResponse  "m2yskBQFythfE4irbTIeOgYYfBU/S730Ilt-Fi-emsQJvJAAShlR6hM"                {'kind': 'youtube#videoCategory', 'etag': '"m2yskBQFythfE4irbTIeOgYYfBU/lL7uWDr_071CHxifjYG1tJrp4Uo"', 'id': '30', 'snippet': {'channelId': 'UCBR8-60-B28hp2BmDPdntcQ', 'title': 'Movies', 'assignable': False}}
18  youtube#videoCategoryListResponse  "m2yskBQFythfE4irbTIeOgYYfBU/S730Ilt-Fi-emsQJvJAAShlR6hM"       {'kind': 'youtube#videoCategory', 'etag': '"m2yskBQFythfE4irbTIeOgYYfBU/WnuVfjO-PyFLO7NTRQIbrGE62nk"', 'id': '31', 'snippet': {'channelId': 'UCBR8-60-B28hp2BmDPdntcQ', 'title': 'Anime/Animation', 'assignable': False}}
19  youtube#videoCategoryListResponse  "m2yskBQFythfE4irbTIeOgYYfBU/S730Ilt-Fi-emsQJvJAAShlR6hM"      {'kind': 'youtube#videoCategory', 'etag': '"m2yskBQFythfE4irbTIeOgYYfBU/ctpH2hGA_UZ3volJT_FTlOg9M00"', 'id': '32', 'snippet': {'channelId': 'UCBR8-60-B28hp2BmDPdntcQ', 'title': 'Action/Adventure', 'assignable': False}}
20  youtube#videoCategoryListResponse  "m2yskBQFythfE4irbTIeOgYYfBU/S730Ilt-Fi-emsQJvJAAShlR6hM"              {'kind': 'youtube#videoCategory', 'etag': '"m2yskBQFythfE4irbTIeOgYYfBU/L0kR3-g1BAo5UD1PLVbQ7LkkDtQ"', 'id': '33', 'snippet': {'channelId': 'UCBR8-60-B28hp2BmDPdntcQ', 'title': 'Classics', 'assignable': False}}
21  youtube#videoCategoryListResponse  "m2yskBQFythfE4irbTIeOgYYfBU/S730Ilt-Fi-emsQJvJAAShlR6hM"                {'kind': 'youtube#videoCategory', 'etag': '"m2yskBQFythfE4irbTIeOgYYfBU/pUZOAC_s9sfiwar639qr_wAB-aI"', 'id': '34', 'snippet': {'channelId': 'UCBR8-60-B28hp2BmDPdntcQ', 'title': 'Comedy', 'assignable': False}}
22  youtube#videoCategoryListResponse  "m2yskBQFythfE4irbTIeOgYYfBU/S730Ilt-Fi-emsQJvJAAShlR6hM"           {'kind': 'youtube#videoCategory', 'etag': '"m2yskBQFythfE4irbTIeOgYYfBU/Xb5JLhtyNRN3AQq021Ds-OV50Jk"', 'id': '35', 'snippet': {'channelId': 'UCBR8-60-B28hp2BmDPdntcQ', 'title': 'Documentary', 'assignable': False}}
23  youtube#videoCategoryListResponse  "m2yskBQFythfE4irbTIeOgYYfBU/S730Ilt-Fi-emsQJvJAAShlR6hM"                 {'kind': 'youtube#videoCategory', 'etag': '"m2yskBQFythfE4irbTIeOgYYfBU/u8WXzF4HIhtEi805__sqjuA4lEk"', 'id': '36', 'snippet': {'channelId': 'UCBR8-60-B28hp2BmDPdntcQ', 'title': 'Drama', 'assignable': False}}
24  youtube#videoCategoryListResponse  "m2yskBQFythfE4irbTIeOgYYfBU/S730Ilt-Fi-emsQJvJAAShlR6hM"                {'kind': 'youtube#videoCategory', 'etag': '"m2yskBQFythfE4irbTIeOgYYfBU/D04PP4Gr7wc4IV_O9G66Z4A8KWQ"', 'id': '37', 'snippet': {'channelId': 'UCBR8-60-B28hp2BmDPdntcQ', 'title': 'Family', 'assignable': False}}
25  youtube#videoCategoryListResponse  "m2yskBQFythfE4irbTIeOgYYfBU/S730Ilt-Fi-emsQJvJAAShlR6hM"               {'kind': 'youtube#videoCategory', 'etag': '"m2yskBQFythfE4irbTIeOgYYfBU/i5-_AceGXQCEEMWU0V8CcQm_vLQ"', 'id': '38', 'snippet': {'channelId': 'UCBR8-60-B28hp2BmDPdntcQ', 'title': 'Foreign', 'assignable': False}}
26  youtube#videoCategoryListResponse  "m2yskBQFythfE4irbTIeOgYYfBU/S730Ilt-Fi-emsQJvJAAShlR6hM"                {'kind': 'youtube#videoCategory', 'etag': '"m2yskBQFythfE4irbTIeOgYYfBU/rtlxd0zOixA9QHdIZB26-St5qgQ"', 'id': '39', 'snippet': {'channelId': 'UCBR8-60-B28hp2BmDPdntcQ', 'title': 'Horror', 'assignable': False}}
27  youtube#videoCategoryListResponse  "m2yskBQFythfE4irbTIeOgYYfBU/S730Ilt-Fi-emsQJvJAAShlR6hM"        {'kind': 'youtube#videoCategory', 'etag': '"m2yskBQFythfE4irbTIeOgYYfBU/N1TrDFLRppxZgBowCJfJCvh0Dpg"', 'id': '40', 'snippet': {'channelId': 'UCBR8-60-B28hp2BmDPdntcQ', 'title': 'Sci-Fi/Fantasy', 'assignable': False}}
28  youtube#videoCategoryListResponse  "m2yskBQFythfE4irbTIeOgYYfBU/S730Ilt-Fi-emsQJvJAAShlR6hM"              {'kind': 'youtube#videoCategory', 'etag': '"m2yskBQFythfE4irbTIeOgYYfBU/7UMGi6zRySqXopr_rv4sZq6Za2E"', 'id': '41', 'snippet': {'channelId': 'UCBR8-60-B28hp2BmDPdntcQ', 'title': 'Thriller', 'assignable': False}}
29  youtube#videoCategoryListResponse  "m2yskBQFythfE4irbTIeOgYYfBU/S730Ilt-Fi-emsQJvJAAShlR6hM"                {'kind': 'youtube#videoCategory', 'etag': '"m2yskBQFythfE4irbTIeOgYYfBU/RScXhi324h8usyIetreAVb-uKeM"', 'id': '42', 'snippet': {'channelId': 'UCBR8-60-B28hp2BmDPdntcQ', 'title': 'Shorts', 'assignable': False}}
30  youtube#videoCategoryListResponse  "m2yskBQFythfE4irbTIeOgYYfBU/S730Ilt-Fi-emsQJvJAAShlR6hM"                 {'kind': 'youtube#videoCategory', 'etag': '"m2yskBQFythfE4irbTIeOgYYfBU/0n9MJVCDLpA8q7aiGVrFsuFsd0A"', 'id': '43', 'snippet': {'channelId': 'UCBR8-60-B28hp2BmDPdntcQ', 'title': 'Shows', 'assignable': False}}
31  youtube#videoCategoryListResponse  "m2yskBQFythfE4irbTIeOgYYfBU/S730Ilt-Fi-emsQJvJAAShlR6hM"              {'kind': 'youtube#videoCategory', 'etag': '"m2yskBQFythfE4irbTIeOgYYfBU/x5NxSf5fz8hn4loSN4rvhwzD_pY"', 'id': '44', 'snippet': {'channelId': 'UCBR8-60-B28hp2BmDPdntcQ', 'title': 'Trailers', 'assignable': False}}